//================================================================================
//
//    失敗ロゴファクトリークラス
//    Author : Araki Kai                                作成日 : 2018/07/24
//
//================================================================================

#ifndef	_FAILURE_LOGO_FACTORY_H_
#define _FAILURE_LOGO_FACTORY_H_



//======================================================================
//
// インクルード文
//
//======================================================================

#include "../FailureLogo.h"
#include "../FailureLogoDraw/failureLogoDraw.h"



//======================================================================
//
// クラス定義
//
//======================================================================

class FailureLogoFactory
{
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
public :
	// メンバ関数
	FailureLogo* Create()
	{
		FailureLogo* temp = new FailureLogo();

		// 初期化
		temp->Init(new FailureLogoDraw());

		return temp;
	}
};



#endif