//================================================================================
//
//    プレイヤークラス
//    Author : Araki Kai                                作成日 : 2018/04/01
//
//================================================================================

#ifndef	_PLAYER_H_
#define _PLAYER_H_



//======================================================================
//
// インクルード文
//
//======================================================================

#include <GameObjectBase/GameObjectBase.h>

#include <Scenes/GameScene/GameScene.h>



//======================================================================
//
// クラス定義
//
//======================================================================

class Player : public GameObjectBase
{
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
public :
	// メンバ関数
	void Init(UpdateBase*        update,
			  DrawBase*          draw,
			  CollisionBase*     collision,
			  GameScene* game_scene);
	void Uninit() override;
	void Reset()  override;


//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
public :
	// 公開メンバ変数
	GameScene* game_scene_;
};



#endif