//================================================================================
//
//    リザルトシーンステートクラス(スタート)
//    Author : Araki Kai                                作成日 : 2018/11/06
//
//================================================================================

#ifndef	_RESULT_SCENE_STATE_START_H_
#define _RESULT_SCENE_STATE_START_H_



//****************************************
// インクルード文
//****************************************
#include <SceneBase/SceneBase.h>



//****************************************
// クラス宣言
//****************************************
class ResultScene;



/*********************************************************//**
* @brief
* リザルトシーンステートクラス(スタート)
*
* リザルトシーンのステートクラス
* 最初の状態を表す
*************************************************************/
class ResultSceneState_Start : public SceneBase::StateAbstract
{
//==============================
// 非静的メンバ変数
//==============================
protected:
	ResultScene* result_scene_ = nullptr;	//!< タイトルシーン



//==============================
// 非静的メンバ関数
//==============================
public:
	/**
	* @brief
	* 初期化関数
	*/
	void Init() override;

	/**
	* @brief
	* 終了関数
	*/
	void Uninit() override;

	/**
	* @brief
	* 更新関数
	*/
	void Update() override;

	/**
	* @brief
	* リセット関数
	*/
	void Reset() override;
};



#endif