//================================================================================
//
//    チュートリアルシーンステートクラス(エンド)
//    Author : Araki Kai                                作成日 : 2018/11/06
//
//================================================================================

#ifndef	_TUTORIAL_SCENE_STATE_END_H_
#define _TUTORIAL_SCENE_STATE_END_H_



//****************************************
// インクルード文
//****************************************
#include <SceneBase/SceneBase.h>



//****************************************
// クラス宣言
//****************************************
class TutorialScene;



/*********************************************************//**
* @brief
* チュートリアルシーンステートクラス(エンド)
*
* チュートリアルシーンのステートクラス
* 最後の状態を表す
*************************************************************/
class TutorialSceneState_End : public SceneBase::StateAbstract
{
//==============================
// 非静的メンバ変数
//==============================
protected:
	TutorialScene* tutorial_scene_ = nullptr;		//!< チュートリアルシーン



//==============================
// 非静的メンバ関数
//==============================
public:
	/**
	* @brief
	* 初期化関数
	*/
	void Init() override;

	/**
	* @brief
	* 終了関数
	*/
	void Uninit() override;

	/**
	* @brief
	* 更新関数
	*/
	void Update() override;

	/**
	* @brief
	* リセット関数
	*/
	void Reset() override;
};



#endif