//================================================================================
//
//    チュートリアルロゴ02ファクトリークラス
//    Author : Araki Kai                                作成日 : 2018/09/02
//
//================================================================================

#ifndef	_TUTORIAL_LOGO_02_FACTORY_H_
#define _TUTORIAL_LOGO_02_FACTORY_H_



//======================================================================
//
// インクルード文
//
//======================================================================

#include "../TutorialLogo02.h"
#include "../TutorialLogo02Draw/TutorialLogo02Draw.h"



//======================================================================
//
// クラス定義
//
//======================================================================

class TutorialLogo02Factory
{
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
public :
	// メンバ関数
	TutorialLogo02* Create()
	{
		TutorialLogo02* temp = new TutorialLogo02();

		// 初期化
		temp->Init(new TutorialLogo02Draw());

		return temp;
	}
};



#endif