//================================================================================
//!	@file	 SceneBase.h
//!	@brief	 シーンBaseClass
//! @details 
//!	@author  Kai Araki									@date 2018/11/02
//================================================================================
#ifndef	_SCENE_BASE_H_
#define _SCENE_BASE_H_



//****************************************
// クラス宣言
//****************************************
class SceneManager;



//************************************************************														   
//! @brief   シーンBaseClass
//!
//! @details シーンのBaseClass
//************************************************************
class SceneBase
{
//====================
// クラス
//====================
public:
	//****************************************														   
	//! @brief   シーンステートBaseClass
	//!
	//! @details シーンステートのBaseClass
	//****************************************
	class StateBase
	{
	//====================
	// 変数
	//====================
	private:
		SceneBase* scene_ = nullptr;		//!< シーン


	//====================
	// プロパティ
	//====================
	public:
		//----------------------------------------
		//! @brief シーン取得関数
		//! @details
		//! @param void なし
		//! @retval SceneBase* シーンポインタ
		//----------------------------------------
		SceneBase* getpScene();

		//----------------------------------------
		//! @brief シーン設定関数
		//! @details
		//! @param[in] value シーンポインタ
		//! @retval void なし
		//----------------------------------------
		void setScene(SceneBase* value);


	//====================
	// 関数
	//====================
	public:
		//----------------------------------------
		//! @brief 仮想デストラクタ
		//! @details
		//! @param void なし
		//----------------------------------------
		virtual ~StateBase() {}

		//----------------------------------------
		//! @brief 初期化関数
		//! @details
		//! @param void なし
		//! @retval void なし
		//----------------------------------------
		virtual void Init() = 0;

		//----------------------------------------
		//! @brief 終了関数
		//! @details
		//! @param void なし
		//! @retval void なし
		//----------------------------------------
		virtual void Uninit() = 0;

		//----------------------------------------
		//! @brief 更新関数
		//! @details
		//! @param void なし
		//! @retval void なし
		//----------------------------------------
		virtual void Update() = 0;

		//----------------------------------------
		//! @brief リセット関数
		//! @details
		//! @param void なし
		//! @retval void なし
		//----------------------------------------
		virtual void Reset() = 0;
	};


//====================
// 変数
//====================
private:
	SceneManager* scene_manager_ = nullptr;		//!< シーンマネージャ
	StateBase* state_ = nullptr;				//!< ステート


//====================
// プロパティ
//====================
public:
	//----------------------------------------
	//! @brief シーンマネージャポインタ取得関数
	//! @details
	//! @param void なし
	//! @retval SceneManager* シーンマネージャポインタ
	//----------------------------------------
	SceneManager* getpSceneManager();

	//----------------------------------------
	//! @brief シーンマネージャポインタ設定関数
	//! @details
	//! @param[in] value シーンマネージャポインタ
	//! @retval void なし
	//----------------------------------------
	void setSceneManager(SceneManager* value);

	//----------------------------------------
	//! @brief ステートポインタ取得関数
	//! @details
	//! @param void なし
	//! @retval StateBase* ステートポインタ
	//----------------------------------------
	StateBase* getpState();

	//----------------------------------------
	//! @brief ステートポインタ設定関数
	//! @details
	//! @param[in] value ステートポインタ
	//! @retval void なし
	//----------------------------------------
	void setState(StateBase* value);


//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief コンストラクタ
	//! @details
	//! @param[in] state 最初のステート
	//----------------------------------------
	SceneBase(StateBase* state);

	//----------------------------------------
	//! @brief 仮想デストラクタ
	//! @details
	//! @param void なし
	//----------------------------------------
	virtual ~SceneBase() {}

	//----------------------------------------
	//! @brief 初期化関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Init();

	//----------------------------------------
	//! @brief 終了関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Uninit();

	//----------------------------------------
	//! @brief 更新関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Update();

	//----------------------------------------
	//! @brief リセット関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Reset();

	//----------------------------------------
	//! @brief ステート解放関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void ReleaseState();
};



#endif