//================================================================================
//
//    敵ファクトリークラス
//    Author : Araki Kai                                作成日 : 2018/07/24
//
//================================================================================

#ifndef	_ENEMY_FACTORY_H_
#define _ENEMY_FACTORY_H_



//======================================================================
//
// インクルード文
//
//======================================================================

#include "../Enemy.h"
#include "../EnemyUpdate/EnemyUpdate.h"
#include "../EnemyDraw/EnemyDraw.h"
#include "../EnemyCollision/EnemyCollision.h"


//======================================================================
//
// クラス定義
//
//======================================================================

class EnemyFactory
{
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
public :
	// メンバ関数
	Enemy* Create()
	{
		Enemy* temp = new Enemy();

		// 初期化
		temp->Init(new EnemyUpdate(),
				   new EnemyDraw(),
				   new EnemyCollision());

		return temp;
	}
};



#endif