//================================================================================
//
//    スカイドームファクトリークラス
//    Author : Araki Kai                                作成日 : 2018/07/22
//
//================================================================================

#ifndef	_SKY_DOME_FACTORY_H_
#define _SKY_DOME_FACTORY_H_



//======================================================================
//
// インクルード文
//
//======================================================================

#include "../SkyDome.h"
#include "../SkyDomeUpdate/SkyDomeUpdate.h"
#include "../SkyDomeDraw/SkyDomeDraw.h"



//======================================================================
//
// クラス定義
//
//======================================================================

class SkyDomeFactory
{
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
public :
	// メンバ関数
	SkyDome* Create()
	{
		SkyDome* temp = new SkyDome();

		// 初期化
		temp->Init(new SkyDomeUpdate(),
				   new SkyDomeDraw());

		return temp;
	}
};



#endif