//================================================================================
//
//    チュートリアルロゴ01ファクトリークラス
//    Author : Araki Kai                                作成日 : 2018/09/02
//
//================================================================================

#ifndef	_TUTORIAL_LOGO_01_FACTORY_H_
#define _TUTORIAL_LOGO_01_FACTORY_H_



//======================================================================
//
// インクルード文
//
//======================================================================

#include "../TutorialLogo01.h"
#include "../TutorialLogo01Draw/TutorialLogo01Draw.h"



//======================================================================
//
// クラス定義
//
//======================================================================

class TutorialLogo01Factory
{
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
public :
	// メンバ関数
	TutorialLogo01* Create()
	{
		TutorialLogo01* temp = new TutorialLogo01();

		// 初期化
		temp->Init(new TutorialLogo01Draw());

		return temp;
	}
};



#endif