//================================================================================
//
//    ゴールクラス
//    Author : Araki Kai                                作成日 : 2018/11/28
//
//================================================================================

#ifndef	_GOAL_H_
#define _GOAL_H_



//****************************************
// インクルード文
//****************************************
#include <GameObjectBase/GameObjectBase.h>



/*********************************************************//**
* @brief
* ゴールクラス
*
* ゴールのクラス
*************************************************************/
class Goal : public GameObjectBase
{
//==============================
// 非静的メンバ関数
//==============================
public:
	/**
	* @brief
	* 初期化関数
	* @param
	* draw : 描画基底クラス
	* collision : 衝突基底クラス
	*/
	void Init(DrawBase* draw,
			  CollisionBase* collision);
	
	/**
	* @brief
	* 終了関数
	*/
	void Uninit() override;
	
	/**
	* @brief
	* リセット関数
	*/
	void Reset()  override;
};



#endif