//================================================================================
//!	@file	 UpdateBase.h
//!	@brief	 更新BaseClass
//! @details 
//!	@author  Kai Araki									@date 2018/11/02
//================================================================================
#ifndef	_UPDATE_BASE_H_
#define _UPDATE_BASE_H_



//****************************************
// インクルード文
//****************************************
#include "../../ComponentBase/ComponentBase.h"

#include <Vector3D.h>



//************************************************************														   
//! @brief   更新BaseClass
//!
//! @details 更新のBaseClass
//************************************************************
class UpdateBase : public ComponentBase
{
//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief 仮想デストラクタ
	//! @details 
	//! @param void なし
	//----------------------------------------
	virtual ~UpdateBase() = 0;

	//----------------------------------------
	//! @brief 後更新関数
	//! @details 
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	virtual void LateUpdate() = 0;
};



#endif