//================================================================================
//!	@file	 AABB.h
//!	@brief	 AABBClass
//! @details 
//!	@author  Kai Araki									@date 2018/05/08
//================================================================================
#ifndef	_AABB_H_
#define _AABB_H_



//****************************************
// インクルード文
//****************************************
#include "../CollisionShapeBase.h"

#include <Vector3D.h>



//************************************************************														   
//! @brief   AABBClass
//!
//! @details AABBのClass
//************************************************************
class AABB : public CollisionShapeBase
{
//====================
// 変数
//====================
private:
	Vector3D position_;	//!< 座標
	Vector3D length_;	//!< 各辺の長さ
	Vector3D min_;		//!< 最小値
	Vector3D max_;		//!< 最大値


//====================
// プロパティ
//====================
public:
	//----------------------------------------
	//! @brief 座標取得関数
	//! @details
	//! @param void なし
	//! @retval Vector3D* 座標
	//----------------------------------------
	Vector3D* getpPositon();

	//----------------------------------------
	//! @brief 各辺の長さ取得関数
	//! @details
	//! @param void なし
	//! @retval Vector3D* 各辺の長さ
	//----------------------------------------
	Vector3D* getpLength();

	//----------------------------------------
	//! @brief 各辺の長さ設定関数
	//! @details
	//! @param[in] value 各辺の長さ
	//! @retval void なし
	//----------------------------------------
	void setLength(Vector3D value);

	//----------------------------------------
	//! @brief 最小値取得関数
	//! @details
	//! @param void なし
	//! @retval Vector3D* 最小値
	//----------------------------------------
	Vector3D* getpMin();

	//----------------------------------------
	//! @brief 最大値取得関数
	//! @details
	//! @param void なし
	//! @retval Vector3D* 最大値
	//----------------------------------------
	Vector3D* getpMax();


//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief コンストラクタ
	//! @details
	//! @param void なし
	//----------------------------------------
	AABB();

	//----------------------------------------
	//! @brief 初期化関数
	//! @details
	//! @param position 座標
	//! @param length   各辺の長さ
	//! @retval void なし
	//----------------------------------------
	void Init(Vector3D position, Vector3D length);

	//----------------------------------------
	//! @brief 更新関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Update();

private:
	//----------------------------------------
	//! @brief 最小値と最大値更新関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void UpdateMinAndMax();
};



#endif