//================================================================================
//
//    更新コンポーネントクラス
//    Author : Araki Kai                                作成日 : 2018/03/26
//
//================================================================================

#ifndef	_UPDATE_COMPONENT_H_
#define _UPDATE_COMPONENT_H_



//======================================================================
//
// インクルード文
//
//======================================================================

#include "../ComponentOrigin/ComponentOrigin.h"


#ifdef _DEBUG
#include <ImGUI\imgui.h>
#include <ImGUI\imgui_impl_dx9.h>
#endif



//======================================================================
//
// クラス定義
//
//======================================================================

class UpdateComponent : public ComponentOrigin
{
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
public :
	// 仮想デストラクタ
	virtual ~UpdateComponent(){}



//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
public :
	// メンバ関数
	virtual void Update()	  = 0;
	virtual void LateUpdate() = 0;

	// デバッグ
	virtual void Debug(){}
};



#endif