//================================================================================
//!	@file	 TutorialScene.h
//!	@brief	 チュートリアルシーンClass
//! @details 
//!	@author  Kai Araki									@date 2018/07/24
//================================================================================
#ifndef	_TUTORIAL_SCENE_H_
#define _TUTORIAL_SCENE_H_



//****************************************
// インクルード文
//****************************************
#include <SceneBase/SceneBase.h>



//****************************************
// クラス宣言
//****************************************
class TutorialLogo;


//************************************************************														   
//! @brief   チュートリアルシーンClass
//!
//! @details チュートリアルシーンを管理するClass
//! @details チュートリアルシーン特有の共有データを持っている
//************************************************************
class TutorialScene : public SceneBase
{
//====================
// 変数
//====================
private:
	TutorialLogo* tutorial_logo_;		//!< チュートリアルロゴ


//====================
// プロパティ
//====================
public:
	//----------------------------------------
	//! @brief チュートリアルロゴ取得関数
	//! @details
	//! @param void なし
	//! @retval TutorialLogo* チュートリアルロゴ
	//----------------------------------------
	TutorialLogo* getpTutorialLogo();

	//----------------------------------------
	//! @brief チュートリアルロゴ設定関数
	//! @details
	//! @param *value チュートリアルロゴ
	//! @retval void なし
	//----------------------------------------
	void setTutorialLogo(TutorialLogo* value);


//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief コンストラクタ
	//! @details
	//! @param *state 最初のステート
	//----------------------------------------
	TutorialScene(StateBase* state);
};



#endif