//================================================================================
//
//    チュートリアルシーンクラス
//    Author : Araki Kai                                作成日 : 2018/09/02
//
//================================================================================

#ifndef	_TUTORIAL_SCENE_H_
#define _TUTORIAL_SCENE_H_



//****************************************
// インクルード文
//****************************************
#include <SceneBase/SceneBase.h>



//****************************************
// クラス宣言
//****************************************
class GameObjectOrigin;



/*********************************************************//**
* @brief
* タイトルシーンクラス
*
* タイトルシーンのクラス
*************************************************************/
class TutorialScene : public SceneBase
{
//==============================
// 非静的メンバ変数
//==============================
private:
	GameObjectOrigin* logo_;



//==============================
// 非静的メンバ関数
//==============================
public:
	/**
	* @brief
	* コンストラクタ
	* @param
	* state : 最初のステート
	*/
	TutorialScene(StateAbstract* state) : SceneBase(state) {}

	// プロパティ
	GameObjectOrigin* GetLogo() { return logo_; }
	void SetLogo(GameObjectOrigin* value) { logo_ = value; }
};



#endif