//================================================================================
//!	@file	 ComponentBase.h
//!	@brief	 コンポーネントBaseClass
//! @details 
//!	@author  Kai Araki									@date 2018/11/02
//================================================================================
#ifndef	_COMPONENT_BASE_H_
#define _COMPONENT_BASE_H_



//****************************************
// インクルード文
//****************************************
#ifdef _DEBUG
#include <ImGUI/imgui.h>
#include <ImGUI/imgui_impl_dx9.h>
#endif



//****************************************
// クラス宣言
//****************************************
class GameObjectBase;



//************************************************************														   
//! @brief   コンポーネントBaseClass
//!
//! @details コンポーネントのBaseClass
//************************************************************
class ComponentBase
{
//====================
// 変数
//====================
private:
	GameObjectBase* game_object_;	//!< ゲームオブジェクト


//====================
// プロパティ
//====================
public:
	//----------------------------------------
	//! @brief ゲームオブジェクト取得関数
	//! @details
	//! @param void なし
	//! @retval GameObjectBase* ゲームオブジェクト
	//----------------------------------------
	GameObjectBase* getpGameObject();
	
	//----------------------------------------
	//! @brief ゲームオブジェクト設定関数
	//! @details
	//! @param value ゲームオブジェクト
	//! @retval void なし
	//----------------------------------------
	void setGameObject(GameObjectBase* value);


//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief 仮想デストラクタ
	//! @details
	//! @param void なし
	//----------------------------------------
	virtual ~ComponentBase() = 0;

	//----------------------------------------
	//! @brief 初期化関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	virtual void Init() = 0;

	//----------------------------------------
	//! @brief 終了関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	virtual void Uninit() = 0;

	//----------------------------------------
	//! @brief 更新関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	virtual void Update() = 0;

	//----------------------------------------
	//! @brief デバッグ表示関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	virtual void DebugDisplay() = 0;
};



#endif