//================================================================================
//
//    衝突形状ベースの原点クラス
//    Author : Araki Kai                                作成日 : 2018/04/25
//
//================================================================================

#ifndef	_COLLISION_SHAPE_ORIGIN_H_
#define _COLLISION_SHAPE_ORIGIN_H_



//======================================================================
//
// クラス定義
//
//======================================================================

class CollisionShapeOrigin
{
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
public :
	enum Type
	{
		TYPE_NONE = -1,
		TYPE_AABB,
		TYPE_CAPSULE,
		TYPE_CYLINDER,
		TYPE_OBB,
		TYPE_PLANE,
		TYPE_SEGMENT,
		TYPE_SPHERE,
		TYPE_TRIANGLE,
		TYPE_MAX
	};


//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
public :
	// デフォルトコンストラクタ
	CollisionShapeOrigin(Type type) : type_(type){}


//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
public :
	// デストラクタ
	virtual ~CollisionShapeOrigin(){}


//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
public :
	// メンバ関数
	Type GetType() {return type_;}


//------------------------------------------------------------
private :
	// メンバ変数
	Type type_;

};



#endif