//================================================================================
//
//    空白更新クラス
//    Author : Araki Kai                                作成日 : 2018/03/22
//
//================================================================================

#ifndef	_UPDATE_NULL_H_
#define _UPDATE_NULL_H_



//****************************************
// インクルード文
//****************************************
#include <assert.h>
#include "../../Base/UpdateBase/UpdateBase.h"



/*********************************************************//**
* @brief
* 空白更新クラス
*
* 更新の空白クラス
*************************************************************/
class UpdateNull : public UpdateBase
{
//==============================
// 非静的メンバ関数
//==============================
public:
	/**
	* @brief
	* 仮想デストラクタ
	*/
	virtual ~UpdateNull() {}

	/**
	* @brief
	* 更新関数
	*/
	virtual void Update() {}

	/**
	* @brief
	* 後更新関数
	*/
	virtual void LateUpdate() {}

	/**
	* @brief
	* デバッグ表示関数
	*/
	virtual void DebugDisplay() {}
};



#endif