//================================================================================
//
//    キーボード入力ヘッダ
//    Author : Araki Kai                                作成日 : 2017/07/25
//
//================================================================================

#ifndef _KYEBOARD_H_
#define _KYEBOARD_H_



//**********************************************************************
//
// インクルード文
//
//**********************************************************************

#include < Windows.h >
#define DIRECTINPUT_VERSION		( 0x0800 )
#include < dinput.h >



//**********************************************************************
//
// プロトタイプ宣言
//
//**********************************************************************

//================================================================================
//
// [ キーボードの初期化関数 ]
//
// ｢ 引数 ｣
//
// ･hInstance : インスタンスハンドル
// ･hWnd : ウィンドウハンドル
//
// ｢ 戻り値 ｣
//
// ･HRESULT型 : エラーチェック用
//
//【 詳細 】
//
// ･キーボードを使用するときの初期化
//
//================================================================================

HRESULT InitKeyboard(HINSTANCE hInstance, HWND hWnd);



//================================================================================
//
// [ キーボードの終了処理関数 ]
//
// ｢ 引数 ｣
//
// ･なし
//
// ｢ 戻り値 ｣
//
// ･なし
//
//【 詳細 】
//
// ･キーボードの使用を終了するときの処理
//
//================================================================================

void UninitKeyboard(void);



//================================================================================
//
// [ キーボードの更新関数 ]
//
// ｢ 引数 ｣
//
// ･なし
//
// ｢ 戻り値 ｣
//
// ･なし
//
//【 詳細 】
//
// ･キーボードの更新
//
//================================================================================

void UpdateKeyboard(void);



//================================================================================
//
// [ キーボードのプレス状態を取得する関数 ]
//
// ｢ 引数 ｣
//
// ･nkey : プレス状態を確認したいキーボードのボタンID
//
// ｢ 戻り値 ｣
//
// ･bool : プレスされてるかフラグを返す
//
//【 詳細 】
//
// ･渡されたキーボードボタンが押されているかを判断する
// ･押されているときはtrue、押されていないときはfalseを返す
//
//================================================================================

bool GetKeyboardPress(int nKey);



//================================================================================
//
// [ キーボードのトリガー状態を取得する関数 ]
//
// ｢ 引数 ｣
//
// ･nkey : トリガー状態を確認したいキーボードのボタンID
//
// ｢ 戻り値 ｣
//
// ･bool : トリガーされてるかフラグを返す
//
//【 詳細 】
//
// ･渡されたキーボードボタンが押された瞬間かどうかを判断する
// ･押した瞬間はtrue、それ以外はfalseを返す
//
//================================================================================

bool GetKeyboardTrigger(int nKey);



//================================================================================
//
// [ キーボードのリピート状態を取得する関数 ]
//
// ｢ 引数 ｣
//
// ･nkey : リピート状態を確認したいキーボードのボタンID
//
// ｢ 戻り値 ｣
//
// ･bool : リピートされてるかフラグを返す
//
//【 詳細 】
//
// ･渡されたキーボードボタンが押されてから一定時間そのままかを判断する
// ･押されてから一定時間そのままのときtrue、押した瞬間はfalseを返す
//
//================================================================================

bool GetKeyboardRepeat(int nKey);



//================================================================================
//
// [ キーボードのリリ－ス状態を取得する関数 ]
//
// ｢ 引数 ｣
//
// ･nkey : リリ－ス状態を確認したいキーボードのボタンID
//
// ｢ 戻り値 ｣
//
// ･bool : リリ－スされてるかフラグを返す
//
//【 詳細 】
//
// ･渡されたキーボードボタンが離された瞬間かどうかを判断する
// ･離した瞬間はtrue、それ以外はfalseを返す
//
//================================================================================

bool GetKeyboardRelease(int nKey);



#endif