//================================================================================
//
//    レンダラーファクトリークラス
//    Author : Araki Kai                                作成日 : 2018/11/01
//
//================================================================================

#ifndef	_RENDERE_FACTORY_H_
#define _RENDERE_FACTORY_H_



//****************************************
// インクルード文
//****************************************
#include "../RendererInterface/RendererInterface.h"



/*********************************************************//**
* @brief
* レンダラーファクトリークラス
*
* レンダラーのファクトリー
*************************************************************/
class RendererFactory
{
//==============================
// 非静的メンバ関数
//==============================
public:
	/**
	* @brief
	* 生成関数
	*/
	virtual RendererInterface* Create() = 0;
};



#endif