//================================================================================
//
//    スコアファクトリークラス
//    Author : Araki Kai                                作成日 : 2018/06/19
//
//================================================================================

#ifndef	_SCORE_FACTORY_H_
#define _SCORE_FACTORY_H_



//======================================================================
//
// インクルード文
//
//======================================================================

#include "../Score.h"
#include "../ScoreUpdate/ScoreUpdate.h"
#include "../ScoreDraw/ScoreDraw.h"



//======================================================================
//
// クラス定義
//
//======================================================================

class ScoreFactory
{
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
public :
	// メンバ関数
	Score* Create(GameScene* game_scene)
	{
		Score* temp = new Score();

		// 初期化
		temp->Init(new ScoreUpdate(),
				   new ScoreDraw(),
				   game_scene);

		return temp;
	}
};



#endif