//================================================================================
//
//    エフェクトファイルヘッダ
//    Author : Araki Kai                                作成日 : 2018/01/04
//
//================================================================================

#ifndef	_EFFECT_FILE_H_
#define _EFFECT_FILE_H_



//**********************************************************************
//
// インクルード文
//
//**********************************************************************

#include <Renderer\RendererDirectX9\RendererDirectX9.h>
#include <Matrix\MatrixSRT_Axis.h>
#include <Vector3D.h>



//**********************************************************************
//
// クラス定義
//
//**********************************************************************

class EffectFile
{
// ============================================================
private :
	// デフォルトコンストラクタ
	EffectFile();


// ============================================================
private	:
	// デストラクタ
	virtual ~EffectFile();


// ============================================================
public :
	// メンバ関数
	void InputEffectFile();
	

// ============================================================
public :
	// 共通メンバ関数
	static EffectFile* GetPointer();
	static void        Create();
	static void        Delete();


// ============================================================
public :
	// 共通メンバ変数
	static EffectFile* effect_file_;


// ============================================================
public :
	// メンバ変数
	int animation_num_;					// アニメーション番号
	Mtx world_matrix_;					// ワールド行列
	Mtx view_matrix_;					// ビュー行列
	Mtx projection_matrix_;				// プロジェクション行列

	LPD3DXEFFECT effect_;				// シェーダー


};



#endif