//================================================================================
//!	@file	 ResultScene.h
//!	@brief	 リザルトシーンClass
//! @details 
//!	@author  Kai Araki									@date 2018/07/24
//================================================================================
#ifndef	_RESULT_SCENE_H_
#define _RESULT_SCENE_H_



//****************************************
// インクルード文
//****************************************
#include <SceneBase/SceneBase.h>



//************************************************************														   
//! @brief   リザルトシーンClass
//!
//! @details リザルトシーンを管理するClass
//! @details リザルトシーン特有の共有データを持っている
//************************************************************
class ResultScene : public SceneBase
{
//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief コンストラクタ
	//! @details
	//! @param *state 最初のステート
	//----------------------------------------
	ResultScene(StateBase* state);
};



#endif