//================================================================================
//
//    リザルトシーンクラスヘッダ
//    Author : Araki Kai                                作成日 : 2018/06/19
//
//================================================================================

#ifndef	_RESULT_SCENE_H_
#define _RESULT_SCENE_H_



//****************************************
// インクルード文
//****************************************
#include <SceneBace/SceneBace.h>



/*********************************************************//**
* @brief
* リザルトシーンクラス
*
* リザルトシーンのクラス
*************************************************************/
class ResultScene : public SceneBace
{
//==============================
// 非静的メンバ関数
//==============================
public:
	/**
	* @brief
	* コンストラクタ
	* @param
	* state : 最初のステート
	*/
	ResultScene(StateAbstract* state) : SceneBace(state) {}
};



#endif