//================================================================================
//
//    ステンシルシャドウテストクラス
//    Author : Araki Kai                                作成日 : 2018/04/01
//
//================================================================================

#ifndef	_STENCIL_SHADOW_TEST_H_
#define _STENCIL_SHADOW_TEST_H_



//======================================================================
//
// インクルード文
//
//======================================================================

#include <GameObjectBase/GameObjectBase.h>

#include <Scenes/GameScene/GameScene.h>



//======================================================================
//
// クラス定義
//
//======================================================================

class StencilShadowTest : public GameObjectBase
{
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
public :
	// メンバ関数
	void Init(DrawBase* draw);
	void Uninit() override;
	void Reset()  override;


//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
public :
	// 公開メンバ変数
	GameScene* game_scene_;
};



#endif