//================================================================================
//
//    カプセルクラス
//    Author : Araki Kai                                作成日 : 2017/12/21
//
//================================================================================

#ifndef	_CAPSULE_H_
#define _CAPSULE_H_



//======================================================================
//
// インクルード文
//
//======================================================================

#include "../CollisionShapeBase.h"
#include "../Cylinder/Cylinder.h"
#include "../Segment/Segment.h"
#include "../Sphere/Sphere.h"

#include <Vector3D.h>



//======================================================================
//
// クラス定義
//
//======================================================================

class Capsule : public CollisionShapeBase
{
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
public :
	// デフォルトコンストラクタ
	Capsule(Segment segment = Segment(Vec3(0.0f, 0.0f, 0.0f), Vec3(0.0f, 0.0f, 0.0f)), 
		    float   radius  = 1.0f);


//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
public :
	// デストラクタ
	virtual ~Capsule();


//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
public :
	// メンバ変数
	Segment  segment_;
	float    radius_;
	Sphere   sphere0_;
	Sphere   sphere1_;
	Cylinder cylinder_;
};





//======================================================================
//
// 非静的メンバ関数定義( inline )
//
//======================================================================

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
// [ デフォルトコンストラクタ ]
//
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

inline Capsule::Capsule(Segment segment, float radius)
	: CollisionShapeBase(CollisionShapeBase::Type::CAPSULE),
	  segment_ (segment), 
	  radius_  (radius),
	  sphere0_ (segment_.position_, radius_),
	  sphere1_ (segment_.GetAddVectorPosition(), radius_),
	  cylinder_(sphere0_.position_, sphere1_.position_, radius)
{
}



//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
// [ デストラクタ ]
//
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

inline Capsule::~Capsule() 
{
}



#endif