//================================================================================
//
//    ピクセルシェーダー基底クラス
//    Author : Araki Kai                                作成日 : 2018/03/26
//
//================================================================================

#ifndef	_PIXEL_SHADER_BASE_H_
#define _PIXEL_SHADER_BASE_H_



//****************************************
// インクルード文
//****************************************
#include "ShaderBase.h"



/*********************************************************//**
* @brief
* ピクセルシェーダー基底クラス
*
* ピクセルシェーダー基底クラス
*************************************************************/
class PixelShaderBase : public ShaderBase
{
//==============================
// 非静的メンバ変数
//==============================
private:
	LPDIRECT3DPIXELSHADER9 pixel_shader_ = nullptr;	//!< ピクセルシェーダー


//==============================
// 非静的メンバ関数
//==============================
public:
	/**
	* @brief
	* シェーダー設定関数
	*/
	void SetShader() override
	{
		GetDevice()->SetPixelShader(pixel_shader_);
	}

	// プロパティ
	LPDIRECT3DPIXELSHADER9 GetPixelShader() { return pixel_shader_; }
};

#endif
